Revit 2027 API
FabricationAncillaryUsage.ProductCode Property
 A unique string code that idnenifies the ancillary in the fabriction database in order to purchase it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ProductCode { get; }
Public ReadOnly Property ProductCode As String
	Get
public:
property String^ ProductCode {
	String^ get ();
}
member ProductCode : string with get
Property Value
String
See Also
Reference
FabricationAncillaryUsage Class
Autodesk.Revit.DB Namespace